let handler = m => m; 
 handler.all = async function (m) { 

   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if  (/^احاا|احااا|احاااا|احااااا|احاااااا|احااااااا|احا$/i.test(m.text) ) {responses = [ 
        `*خيـر اش في ياعزيزي*`,
          `*احتيــن*`, 
          `*اهممممممم*`, 
     
];
} 
if (/^انقلع|انقلع | انقلع | انقلع $/i.test(m.text) ) { responses = [  
    `*من بعدك يلا اشوف ..🙂*`, 
     `*والسبب يا باكا ..؟*`, 
      `*وعع هقلعك معي .. 🗿*`,
  
];
 }
if (/^آستا|استا$/i.test(m.text) ) { responses = [  
    `*عــــمـــك*`, 
     `*عــــمـــك يـــا ورع*`, 
      `*🗿*`,
  
];
 }
  
   if  (/^ليش|لييش|وش|وشش |لماذا|والسبب|السبب|كيف|كيفه$/i.test(m.text) ) {responses = [ 
        `*معرفش.. 🐦*`,
     `*لو بعرف هكلمك ..🐦*`, 
          `*ماادري بس هفكر ..🐦*`, 
         `*واضح مسأله معقده ..🗿*`,
           `*هشوف حل ..☕️🗿*`,
];
} 

if (/^شادو تحتاج مساعده$/i.test(m.text) ) { responses = [  
    `*لا حبيبي شكرا*`, 
     `*شكرا لا احتاج ل احد*`, 
      `*لا يشيطاني الصغير*`,
  
];
}
if (/^تفهم|تفهم | تفهم$/i.test(m.text) ) { responses = [  
    `*حبيبي شكرا*`, 
     `*شكرا*`, 
      `*من فهمك يا شيطاني الصغير*`,
       `*من فهك اكيد ي سنسى*`,
  
];
 }

if (/^مابعرف|ما اعرف|ماادري|ما ادري$/i.test(m.text) ) { responses = [  
    `*حتى انا*`, 
     `*همم طيب*`, 
      `*حسبنا الله ونعم الوكيل*`,
  
];
}

if (/^لوفي$/i.test(m.text) ) { responses = [  
    `*مـلك القـراصـنه*`, 
         `*عـمـك بعد آس؁تــا*`, 
];
}
   

   if (/^عبيط|باكا|اهبل|غبي$/i.test(m.text) ) { responses = [ 
      `*بـاكـا يـارو بيـبي*`,
       `*شـوف نفسـك*`,
         `*اورسيندايو كسوقاكي*`,
          `*وبعدين.. ؟*`,
     
];
 }
   
if (/^بووت|بوووت|بوتت|البوت|بووووت|بوت| بوت $/i.test(m.text) ) { responses = [ 
     `*اسـمي شادو بـوت بعيـنك*`, 
  `*يبدو ان دماغك معطل هل نصلحه*`, 
      `*ناديني شادو ياعزيزي*`, 
         `*اسمي شادو*`, 
     `*انا انسان وليس بوت يااحمق*`, 
         `*اذهــب الى الجحيـم*`, 
        `*بـاكــا اسمي شادو*`,
     `*هههه بس انقـلع قـال بـوت*`,
     `*ان شاء الله تتحول بـوت اسمي شادو*`,
      `*كم مره يجب علي قول ذالك ..*`,
       `*والله اسمي شادو وعع آس؁تــا دخلني بمكان حسبي الله بس*`,
        `*ما يجي منك الا بوت .. ان شاءالله تكون بوت*`,
         `*مليت منك .. فقط اخرس*`,
];
  }
   
   if (/^شادو|شادو | شادو | شادو$/i.test(m.text) ) { responses = [  
    `*اطـلب واتمنى*`, 
     `*ماذا هناك*`,  
     `*ماذا هناك ياشيطاني الصغير*`, 
       `*خير اش تبي*`, 
        `*عيـون شادو*`, 
          `*عــيونــي*`, 
        `*لبيـهه يشيطان*`, 
         `*تفضـل*`, 
        `*هاا*`,
        `*حبيب شادو*`,
          `*تدلل*`,
        `*شريــان شادو*`,
          `*وتيــن شادو*`,
  ];
  }
    if (/^غوجو$/i. test(m.text) ) { responses = [   
        `*اقوى واحد في العالم*`,
           `*عم غيـتتو*`, 
           `*جلااد غيـتو*`,
          `*جلاااد ماهيـتو*`,
      `*عـم سوكونا*`,
      `*جلاد سوكونا*`,
  ];
   } 

if (/^سكونا$/i.test(m.text) ) { responses = [ 
         `*ملـــك اللعــنات*`, 
         `*عمـووو الشريـر*`,
  `*غوجو عمه*`,
    ];  
    }
  
 if (/^يب$/i.test(m.text) ) {responses = [ 
       `*قـول نـعم يـحب♥️✨*`, 
           `*قـول نعـم*`,
        `*قـول نعـم يــحب*`,
       `*وش هيصير اذا قلت نعم؟*`,
       `*يبات*`,
 ];                 
 } 

   
if (/^شادو كيفك$/i.test(m.text) ) { responses = [ 
     '*تمام بخير وانت كيفك حبيبي*',
     `*تمام بخير ياشيطاني الصغيـر*`,
  


];
   }
   
   if (/^سابو|سانيمي|السيد آستا|دوما|ارثر|ايتاتشي|ايتاشي|سينكو$/i.test(m.text) ) { responses = [ 
         '*عــــمـــك*',
];
   }
 if (/^اوهايو$/i.test(m.text) ) { responses = [ 
        `*اوهايـو كزايـمـس*`, 
];
 } 

   if (/^سانجي|سونغ|مايكي|سابو|دراكن|ساتارو$/i.test(m.text) ) { responses = [ 
    '*صـديق آستا*♥️✨', 
  ];
   }
 if (/^خاص|خاصك |خاصها$/i.test(m.text) ) { responses = [ 
         `*الخـاص لـرخـاص*`,
         `*اذهـب يا احمق*`,
         `*وععععع*`,

 ];
 } 
  
 if (/^امزح|مزح$/i.test(m.text) ) { responses = [ 
     `*لاتقول امزح ترا مزحك ثقيل*`, 
     `*تجرح في كلامك ثم تقول بهزر*`,
       `*اش مـن امزح تع المحكـمه*`,
 ]; 
   } 
  
 if (/^غوكو|غوكو عمك$/i.test(m.text) ) { responses = [ 
      `*يالك مـن احمـق*`, 
   `*قصدك من انمي الجبهات الكبيره؟*`,
];
} 
   
if (/^تست$/i.test(m.text) ) { responses = [ 
          `*تسـت تسـت*`,
          `*تسـت♥️✨*`,
            `*تستات*`,
];  
 } 
  
 if (/^تحبني|تحبني | تحبني | تحبني$/i.test(m.text) ) {responses = [ 
         `*احبـك نص بس*`, 
         `*امـوت فيك*`,
          `*لا اكرهــكك*`,
           `*بفـــكر*`,
        `*ان شاء اللــه*`,
        `*احتـرم نفســك*`,
 ]; 
 } 
  
 if (/^انا جيت|اجيت|رجعت|اتيت|جيت$/i.test(m.text) ) { responses = [ 
          `*نـورت يـقلبي*`,
       `*ارجع مـن حيث اتيـت*`,
       `*كنا مرتاحين في غيابك*`,
         `*ليش جيـت اصلا*`,
          `*لاتجـي انقلع*`,
          `*نورت اكيد*`,
          `*منور بنوري*`,
          `*هلا فيك نورت*`
 ];
 } 
  
 if (/^اخرسي|اخرس$/i.test(m.text) ) { responses = [ 
        `*تبي اصـلح دماغك*`, 
         `*اخرس انـت*`,
   `*وميـن انت ع شان تتكلـم معي كذا*`,
          `*احـــمق*`,
          `*حاضر*`,
 ]; 
 } 
  
 if (/^حرامي|سارق$/i.test(m.text) ) { responses = [ 
    `*تتهـم بدون ادله يا احمـق*`, 
  `*كيف عرفت مسوي دور المحقق*`,
   `*بس اسكـت خلي الناس بحـالها*`,
         `*شــووف نفسـك*`,
 ];     
 } 
 if (/^ملل|مللل|ملللل$/i.test(m.text) ) { responses = [ 
     `*عارفين ف اسكـت احسن لك*`, 
      `*طيب والحـل*`,
       `*تبي تلـعب يعني*`,
   
 ]; 
 } 
  
 if (/^سلام|السلام عليكم|سلام عليكم|سلام عليكم ورحمه الله وبركاته $/i.test(m.text) ) { responses = [ 
   `*وعليكم السلام ورحمة الله وبركاته*`, 
        `*عليـكم سلام*`,
   `*وعليكم سلام نورت ياشيطاني الصغير*`,
 ]; 
 } 
  
 if (/^بوت وش اسمك|بوت ايش اسمك | بوت ايش اسمك| بوت ايش اسمك $/i.test(m.text) ) { responses = [ 
        `*اسمي شادو ياعزيزي*`, 
    `*بـــوت في راسـك اسمي شادو*`,
        `*هههههـة بس انقـلع*`,
  ];
 } 
   
     
 if (/^🤖$/i.test(m.text) ) { responses = [ 
    `*انت بوت عشان ترسل الملصق ذه*`, 
      `*مسوي حالك بـوت يـعني*`,
         `*يشبهـك*`,
];
 } 
     
 if (/^🐦|🐦‍⬛$/i.test(m.text) ) {responses = [  
     `🐦🐦🐦🐦🐦`, 
     `🐦‍⬛🐦‍⬛🐦‍⬛🐦‍⬛🐦‍⬛ `, 
      `*انـضـر بعيـد*`, 
      `*واش بـلاك*`,
       `*🗿☕️*`,
        `*تفضل عصير .. 🍷🗿*`
];
 } 
  
  if (/^فخم|نايس|حلو | حلو| حلو |حلو|نايس $/i.test(m.text) ) { responses = [ 
      `*مـن ذوقك ياعزيزي الصغير*`,  
            `*عيــووونك*`, 
            `*مو احـــلا منـــك*`,
            `*انـــت احـــلا*`
    ];
  
  }
if (/^نعم$/i.test(m.text) ) { responses = [  
         `*حد نـاداك*`, 
      `*ميـن ناداك ياابااكا*`, 
       `*حـد نادا  باسمـك؟*`,
 ]; 
                            

  } 
if  (/^ران|@201102471574|Ran$/i.test(m.text) ) {responses = [ 
        `*عمتك*`,
     `*عمتك ي ورع .. 🐦*`, 
          `*وش تبي .. 🐦🐦*`, 
];
                                                
  }
 if (/^كيفك|شخبارك|علومك|عامل ايه$/i.test(m.text) ) { responses = [ 
      `*الـحمدلله بخيـر دامك بخير*`,
        `*دامك بخير لاتسئل*`, 
          `*مثل حـالك*`,
      `*الحمدلله على كل حـال*`,
 ];
                                                     } 
 if  (/^دوم|دووم|دوووم|دووووم|دووووووم|دووووووووم$/i.test(m.text) ) {responses = [ 
             'نبضك..❤️‍🔥',  
                  'ايامكم الحلوه..🙂',  
                 'عزك ..🫂',  
                     'بدواااامك.. 🙃', 
];
                                                     } 
    if  (/^أحبك|احبك|شادو اموت فيك|احبك يا شادو|حبيبي|حبيبي $/i.test(m.text) ) {responses = [ 
        `*وانا لا ..🐦*`,
       'شكرا  ',  
       'بفكر في الامر',  
             'و انا',  
                   'خجلتني',  
                         'خلاص لا تخجلني ',  
             'اسكتتتتت ترا اضربك عيب وش هل كلام   ',  
                                   'طيب و بعدين '  
, 
];
                                                     } 
    if  (/^اسلام عليكم|سلام|سلام عليكم|اسلام عليكم ورحمه الله وبركاته|سلام عليكم ورحمه الله وبركاته$/i.test(m.text) ) {responses = [ 
        `*وعليكم السلام *`,
     `*وعليكم السلام كيفك*`, 
          `*وعليكم السلام ورحمة الله وبركاته نورت ..*`, 
];
                                                     } 
    if  (/^زق|كلزق|زق عليك|زق | زق | زق|خرا |خرا| خرا| خرا |أمك |امك|امك | امك $/i.test(m.text) ) {responses = [ 
        `*عيب ..🐦*`,
     `*وسخ تأدب .. 🐦*`, 
          `*الله يهديك*`,
          '*عيب يا طفل ..🗿*',
];
                                                     } 

if  (/^متأكد|متاكد|واثق من كلامك |واثق |واثق$/i.test(m.text) ) {responses = [ 
             '*يب .. 🙃*',  
                  '*متأكدد .. 🗿*',  
                 'يب 99.99% .. 🗿🍷',  
                     '*اعتقد هذا .. 😒*', 
];
                                                     } 
if  (/^اسكت|اخرس|يا ابني اسكت|شادو اسكت$/i.test(m.text) ) {responses = [ 
             'ما دخلك ..',  
               ' مش علي كيفك ..',  
                 'لا يا مين انت؟؟ ..',  
                     'اسكت انت ..', 
];
                                                     } 
if  (/^@967778088098|@967778088098 | @967778088098$/i.test(m.text) ) {responses = [ 
             '> *عمك ..🐦*',  
                  '> *عمي وعمك .. 🚬🐦*',  
                 '> *دا المطور احتمال مشغول هشش .. 🚬🗿*',  
                     '*🚬🗿 .. وبعدين ؟*' 
, 
];
                                                     }  
if  (/^صباح الخير|صباح الورد|صباحكم|صباح|صباح الفل$/i.test(m.text) ) {responses = [ 
       ' صباح الفل ',  
          '  صباح المدرسة',  
              ' صباح ولا مساء ',  
                  '  انا بنام تصبح على خير ',  
                   ' روح كمل نوم', 
];
                                                     } 
   if  (/^ما تفعل|ما تسوي|ماتفعل|ماتسوي|وش تسوي|وش تفعل | الحين وش تسوي|ماذا تفعل|ماذا تسوي$/i.test(m.text) ) {responses = [ 
        `*قاعد اكلمك ..🐦*`,
        `*اشوف انمي .. 🙂*`, 
        `*أقرا كتاب .. 🗿*`, 
        '*ولا شي وانت ؟*',
         '*اشوف التلفاز ولقيت اشياء خايسه .. الأنمي عمك*',
         '*آكل وانت؟*',
   ];                                                                                 
                                                     } 
   if  (/^كفو|كفو | كفو |كفوو|كفوو |كفوووو| كفوووو|وربي كفو|كفوووو $/i.test(m.text) ) {responses = [ 
        `*كفووك الطيب*`,
     `*كفوك*`, 
          `*كفو من رباك*`, 
];
                                                     } 
if  (/^بخير |بخير الحمد لله|لابأس|بخير دامك بخير|طيب الحمد لله  |الحمد لله |الحمد لله$/i.test(m.text) ) {responses = [ 
        `*الحمد لله*`,
     `*يدوم حمد الله .. 🐦*`, 
          `*الحمد لله ..🙂*`, 
];
                                                     } 
if  (/^نورت|نورتي|منور|منوره|نورتنا|منورين|منور $/i.test(m.text) ) {responses = [ 
        `*اكيد بنوري*`,
     `*بنور اللمبه*`, 
    `*يب نوررر ساطع*`,
      '*نور الجوال*',
      '*وين النور دا نور عيونكم .. 😂*',
        ' تسليييييك ...😂',
];
                                                     }
 if  (/^اها | اها |اها$/i.test(m.text) ) {responses = [ 
        `*يب*`,
     `*بضبط*`, 
          `*اعتقد هذا*`, 
];
                                                     } 
if  (/^الا$/i.test(m.text) ) {responses = [ 
        `*لا*`,
     `*حرفيا لا*`, 
          `*لا يعني لا*`,
              'اوفااااا',
              'افهم',
               'طيب'
];
                                                     }    
 if  (/^ههه|هههه|ههههه|ههههههه|هههههههه|ههههههههه|ههههههههههه|ههههههههههههه|هيهيه$/i.test(m.text) ) {responses = [ 
       'دوم هل ضحكة ',  
            ' دايمه',  
                   'دوم يا رب',  
                         'ههه ',  
                         'ههههههههه',  
                         'ايش لي يضحك',  
                         'اضحك معاك؟',  
                             'دوم ' ,                                                            
]; 
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;