let handler = async (m, { conn }) => {
 await conn.sendMessage(m.chat, { react: { text: '🔒', key: m.key } })
m.reply(global.terminos)}
handler.customPrefix = /términos y condiciones y privacidad|terminosycondicionesyprivacidad|terminosycondiciones|privacidad|الاستخدام|الخصوصيه|الخصوصية|الخصوصيه ولا الاستخدام|شروط الخصوصية|شروط الخصوصيه|شروط الاستخدام/i
handler.command = new RegExp
export default handler

global.terminos = `*~𝕯𝖊𝖆𝖙𝖍⊰ ✎ ⊱𝐍𝖔𝖙𝖊~*

*ــــــ❖╎القوانين╎❖ــــــ* 

*←نصت القوانين العامة لحفظ حقوق كل عضو ونتمنى التزامكم بها*

◎ ─━──━─✎─━──━─ ◎

*¹ ــــــ❖╎دواعي ♧ الإنذار╎❖ــــــ*
◈╎تكاسل المشرفين بعمل واجبهم  بالنقابه
◈╎التشفير 
◈╎ارسال 4 ملصقات متتالية (سبام)
◈╎ارسال اكثر من 9 رسائل بلا فائده (سبام)
◈╎الاعتراض على قرار المشرف
◈╎التحدث باللغات غير مفهمومة و عدم التوقف
◈╎العنصرية 
◈╎التكلم عن حلقة لم يمر عليها 24 ساعة
◈╎ارسال ملصقات كيبوب
◈╎طلب رتبة و ازعاج المسؤولين
◈╎الاعتراض على انذار ( عندك اعتراض اشتكي للامبراطور او لاحد نوابه ) 

◎ ─━──━─✎─━──━─ ◎

*²ــــــ❖╎دواعي الطــــ♤ــــرد التأديبي╎❖ــــــ*
◈╎صورة شخصية ( لك او لغيرك)
◈╎امور السياسة وا الدين
◈╎الحرق بجميع انواعه

◎ ─━──━─✎─━──━─ ◎

*³ــــــ❖╎دواعي الطــــ◇ــــرد المؤبد╎❖ــــــ*
◈╎سحب ادمن اكثر من اسبوع 
◈╎تهديد الاعضاء بالباند و غيرها
◈╎ابتزاز شخص بالخاص او تلقي شكوى منك
◈╎النشر لقروب آخر ( سرقة الاعضاء)
◈╎ارسال ملصق او صورة او اي شي له علاقة بالهنتاي و الايتشي
◈╎القذف و السب
◈╎الدخول بنية التخريب
◈╎افتعال المشاكل عمدًا

◎ ─━──━─✎─━──━─ ◎

*ــــــ❖╎اللــوازم╎❖ــــــ*

◈╎ تجاهل التنبيه = إنذار
◈╎ 3 إنذارات = طرد 3 أيام
◈╎5 انذارات = طرد مؤبد
◈╎التنبيه والانذار يحذفان بعد 3أيام
◈╎تكرار المخالفة = مضاعفة العقوبة

◈╎ يطرد الغير متفاعلين بشكل دوري

← *◈الشكوى عند الإمبراطور او النائب*

◎ ─━──━─✎─━──━─ ◎`
