import fs from 'fs'
import fetch from 'node-fetch'
import { xpRange } from '../lib/levelling.js'
const { levelling } = '../lib/levelling.js'
import PhoneNumber from 'awesome-phonenumber'
import { promises } from 'fs'
import { join } from 'path'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems }) => {
 await conn.sendMessage(m.chat, { react: { text: '🔟', key: m.key } })
try {
let vn = './media/1.mp3'
let pp = imagen4
let img = await(await fetch('https://telegra.ph/file/d7ae77d1178f9de50825c.jpg')).buffer()
let d = new Date(new Date + 3600000)
let locale = 'ar'
let week = d.toLocaleDateString(locale, { weekday: 'long' })
let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
let _uptime = process.uptime() * 1000
let uptime = clockString(_uptime)
let user = global.db.data.users[m.sender]
let { money, joincount } = global.db.data.users[m.sender]
let { exp, limit, level, role } = global.db.data.users[m.sender]
let { min, xp, max } = xpRange(level, global.multiplier)
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(850)   
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let str = `◎ ─━──━─𝑺𝒉𝒂𝒅𝒐𝒘─━──━─ ◎

*جـعلك تحـتاج هـذه القـائمة جـزء مـن خطـتي ..*

*أهـ♕ـلا ي بـوت .. معـك شـادو ..✎*

*بوتــ خــاصـ بممـ♕ـلكة:𝕯𝖊𝖆𝖙𝖍⊰ ✎ ⊱𝐍𝖔𝖙𝖊*

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎

*✗القسم الأول اوامر الجروب ..*

 ◎ ─━──━─⊰ ♚ ⊱─━──━─ ◎
 
*⚡️.الخصوصيه/الاستخدام ↫يوضح لك السياسه والخصوصيه التي وضعها المطور*

*⚡️.الاستماره/استماره ↫يجيب لك استماره نقابتك بس كلم المطور ل اضافتها*

*⚡️.منشن ↫يمنشن لك للجروب كله*

*⚡️.الاشباح ↫يجيبلك الاعضاء الى مابتتفاعلش*

*⚡️.مخفي ↫يمنشن لك للجروب كله بس بطريقه مخفيه*

*⚡️.رفع ↫يرفع لك اي احد تمنشن عليه من عضو الي مشرف*

*⚡️.خفض ↫ينزل لك المشرف الي عضو*

*⚡️.تغيرالصوره ↫يغير لك صوره الجروب*

*⚡️.لينك ↫يجيب لك لينك الجروب*

*⚡️.جروب غلق ↫يقفل الشات علي الكل ماعدا المشرفين*

*⚡️.جروب فتح ↫يفتح الجروب للكل*

*⚡️.احذف ↫يحذف البوت اي رساله تمنشن عليها*

*⚡️.رستر ↫يرستر او يعمل اعاده تعين للينك الجروب*

*⚡.الجروب ↫يجيبلك معلومات الجروب كامله*

*⚡.احذف /حذف ↫يحذف الرسائل فى القروب*

*⚡.تحذير ↫يسوي تحذير او بلاغ ل اى شخص تريده*

*⚡.ازاله-التحذير او رفع -الانذار ↫يرفع الانذار عن اى شخص*

*⚡.رفع ↫مع المنشن يرفع اي شخص تريده*

*⚡.خفض ↫مع المنشن يخفض اي شخص من ادمن إلى عضو

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎

*القسـم الثاني قسـم المالك ...*

 ◎ ─━──━─⊰ ♛ ⊱─━──━─ ◎

*☁️.ادخل/انضم ↫البوت يدخل الجروب*

*☁️.اخرج ↫البوت يخرج من الجروب*

*☁️حطها-بروفايل ↫يحط البوت الصوره لك بروفايل*

*☁️.بان ↫المطور يبند اي احد و يحرمه من البوت*

*☁️.رفع-البان ↫البوت يرفع البان*

*☁️.بان-شات ↫يحظر المطور الشات للبوت*

*☁️.بان-شات-فك ↫يرجع المطور الشات للبوت*

*☁️.حظر/بلوك ↫يحظر المطور و يبلكوه من استخدام البوت*

*☁️.رفع-الحظر/.رفع-البلوك/ ↫يفك المطور الحظر أو البلوك*

*☁️.الغاء-الحظر ↫الغاء حظر الشات للبوت*

*☁️.اضف-اكسبي ↫يرفع المطور لفل اي احد ضاع منه*

*☁️.اضف-الماس ↫يضيف المطور الماس ل اي شخص*

*☁️.بريم ↫يعطي المطور للبوت رقم اي شخص يقدر يستخدمه مثله*

*☁️.المميزين ↫الاشخاص البريميوم*

*☁️.البلوكات ↫الاشخاص الي واخدين بلوك من البوت*

*☁️.ازاله-التحذير او رفع -الانذار ↫يرفع الانذار عن اى شخص*

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎

*✗القـسم الثالث قـسم الأعـضاء ..*

 ◎ ─━──━─⊰ ♝ ⊱─━──━─ ◎

*🍁.تصميم ↫الحصول علي تصميم من البوت*

*🍁.صوت-انمي1 ↫ يجيبلك اصوات انمي ( 1 : 7 ) اصوات*

*🍁.دمج ↫يدمج لك اي ايموجي*

*🍁.المطور ↫يعرض لك المطور بتاع البوت*

*🍁.منشني ↫يمنشنك*

*🍁.زخرفه ↫يزغرف لك اي نص*

*🍁.كود ↫البوت يصنع باركود*

*🍁.سرعه ↫يجيب لك تفاصيل السرعه*

*🍁.الشخصيه و تحط اسم ↫يخمن شخصيتك*

*🍁.بروفايلي/بروفايل/البروفايل/انا ↫يجيب لك بروفايلك ب كذا طريقه*

*🍁.انطق/انطقي ↫ينطق لك اي شي تكتبه عربي/ياباني*

*🍁.شادو ↫ذكاء اصطناعي*

*🍁.تحدث ↫ذكاء اصطناعي*

*🍁.يوجد امر واحد فقط بالانجليزي وهو .logo*

*🍁.تخيل ↫يجيب لك اي شي تتخيله*

*🍁.ترجم ↫تكتب النص فى اي لغه رح يترجم*

*🍁.قدوتي ↫يجبلك صور عشوائيه*

*🍁.افتار ↫يجيب لك افتارات انمي او اي افتار تبحث عليه*

*🍁.ميمز ↫يجبلك ميمز انيم*

*🍁.انمي ↫انمي ثم اسم الانمي يعطيك معلومات الانمي*

*🍁.الله ↫يجبلك اسماء الله الحسناء*

*🍁.حديث /احاديث ↫يجبلك احاديث*

*🍁.نصيحه ↫يجبلك نصيحه*

*🍁.قرأن ↫يجبلك ايات قرأنيه*

*🍁..ايدت ↫يجبلك تصميم انمي*

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎
 
*✗القسم الرابع قسـم التنزيل ..*

 ◎ ─━──━─⊰ ♟ ⊱─━──━─ ◎

*✉️.يوتيوب ↫يبحث لك في يوتيوب*

*✉️.شغل ↫يجيب صوت عشوائي بنفس الأسم من اليوتيوب*

*✉️.تيك/تيكتوك ↫يجيب لك اي فيديو من تيك توك*

*✉️.تطقيم ↫يجيب صوره ولد و بنت*

*✉️.تطقيم-اولاد ↫يجيب صوره ولد و ولد*

*✉️.تطقيمي ↫يجيب صوره بنت و بنت*

*✉️.اغنيه ↫يحمل لك اي اغنيه*

*✉️.قط ↫صور لقطط عشوائيه*

*✉️.كلب ↫صور لكلاب عشوائيه*

*✉️.فيديو ↫يحمل لك اي فيديو*

*✉️.تطبيق ↫يحمل لك اي تطبيق*

*✉️.افتار ↫يجيب صور من بنتريست*

*✉️.لكرتون ↫يحول صورك لكرتون مع تحويل الوجه لاستيكر*

*✉️.لانمي ↫تحويل صورك لانمي بالذكاء الاصطناعي*

*✉️.صوره ↫الحصول علي صوره من جوجل*

*✉️.فريبيك ↫الحصول علي الصور من موقع فري بيك*

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎

*✗القـسم الخامس قسـم التحـويل آلـي*

 ◎ ─━──━─⊰ ♧ ⊱─━──━─ ◎

*⚙️.سرقه/حقوق↫يسرق لك اي ملصق لحقوقك*

*⚙️.لصوره↫يحول لك اي ملصق لصوره*

*⚙️.لفيديو↫يحول اي ملصق لفيديو*

*⚙️.ملصق↫يحول اي صوره ل ملصق*

*⚙️.ستك↫يعمل لك لوغو ب اسمك*

*⚙️.ترجم↫يترجم لك اي كلمه*

*⚙️.تليجراف↫يرفع لك اي صوره تليجراف*

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎

*✗القسم السادس قسم التسليه ..*

 ◎ ─━──━─⊰ ♤ ⊱─━──━─ ◎

*🕹️.(.) ↫يسالك اي سؤال*

*🕹️.اكس_او ↫يجيب لك لعبه اكس او تيك تاك تو*

*🕹️.احذف اللعبه/ ديليت/dlttt. ↫يحذف البوت اكس او*

*🕹️.كت ↫يجيب لك شخصيه انمي عشوائي*

*🕹️.لو ↫يسالك اسئله لو خيروك*

*🕹️.سؤال ↫يسالك اي سؤال*

*🕹️.تاج ↫يقول لك اي جمله*

*🕹️.ذكاء ↫يجيب نسبه الذكاء عشوائي ل اي شخص*

*🕹️.الحب ↫يجيب نسبه الحب ل اي شخص*

*🕹️.احرز ↫يجيب لك صور انمي و تحذر اسمها*

*🕹️.مقولات*
*↫الحصول علي اقتباسات انمي*

*🕹️.حظي ↫يطلع نسبه حظك عشوائي*

*↫🕹️.الجمال ↫يجيب نسبه الجمال عشوائي*

*🕹️.نصيحه↫يقول لك اى حاجه*

*🕹️.شخصيه ↫يجبلك صوره انمي وتحذر اسمها*

*🕹️.الرياضيات ↫لعبه رياضيات*

*🕹️.حب /الحب ↫نسبه حبك لشخص فى القروب مع المنشن*

*🕹️.جمع ↫يجبلك اسماء شخصيات مفككه و انت تجمعها*

*🕹️.فكك ↫يجبلك اسماء شخصيات وانت تفككها*

*🕹️.رفيق ↫يجبلك اسم رفيقك في الجروب *

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎

*✗القـسم السابع اوامـر البـنك ..*

 ◎ ─━──━─⊰ ♜ ⊱─━──━─ ◎

*🧱.التفعيل ↫التفعيل اسمك عمرك*

*🧱.لفل ↫يجيب لك البوت لفلك علي حسب تفاعلك معه*

*🧱.الماسي ↫يجيب لك الماسك*

*🧱.راتب ↫يعطيك راتبك*

*🧱.يومي ↫يعطيك يوميتك*

*🧱.اسبوعي ↫يعطيك اسبوعك*

*🧱.شهري ↫يعطيك شهرك*

*🧱.هجوم ↫تسرق اكسبي نقاط من الشخص الي تمنشن عليه*

*🧱.البنك ↫يجيب لك اشياء البنك*

*🧱.تعدين ↫يجبلك نقاط*

*🧱.نقل ↫ينقل نقاطك*

*🧱شراء. ↫يتم شراء ** *

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎

*✗القـسم الثامن اوامـر القرأن ..*

 ◎ ─━──━─⊰ ♜ ⊱─━──━─ ◎

*⚡️.اذكار الصباح ↫يجيبلك اذكار الصباح*

*⚡️.اذكار المساء ↫يجيبلك اذكار المساء*

*⚡️.صوت1 ↫يجيبلك قران بدون مايك ( 1 : 7 ) اصوات*

*⚡️.اية ↫يجيبلك ايه من القران الكريم*

*⚡️.ايه ↫يجيب لك آية الكرسي*

*⚡️.الله (1:99) ↫يجيبلك اسماء اللة الحسنى بترتيب حسب الرقم*

 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎
*~⌬ تـ✍︎ـوقيعي/*
*~آس؁تــا~*
 ◎ ─━──━─⊰ ✎ ⊱─━──━─ ◎
*~⌬ تـ✍︎ـوقيعي/*
*~آس؁تــا~*`.trim()
let buttonMessage = {
image: pp,
caption: str.trim(),
mentions: [m.sender],
footer: `${wm}`,
headerType: 4,
contextInfo: {
mentionedJid: [m.sender],
externalAdReply: {
showAdAttribution: true,
mediaType: 'VIDEO',
mediaUrl: null,
title: '『┇𝐒𝐇𝐀𝐃𝐎𝐖_Bot┇』',
body: null,
thumbnail: img,
sourceUrl: `https://telegra.ph/file/d7ae77d1178f9de50825c.jpg`
}}}
conn.sendMessage(m.chat, buttonMessage, { quoted: m })
//await conn.sendFile(m.chat, vn, 'menu.mp3', null, m, true, { type: 'audioMessage', ptt: true})
} catch {
conn.reply(m.chat, '[❗𝐈𝐍𝐅𝐎❗] 𝙴𝙻 𝙼𝙴𝙽𝚄 𝚃𝙸𝙴𝙽𝙴 𝚄𝙽 𝙴𝚁𝚁𝙾𝚁 𝚈 𝙽𝙾 𝙵𝚄𝙴 𝙿𝙾𝚂𝙸𝙱𝙻𝙴 𝙴𝙽𝚅𝙸𝙰𝚁𝙻𝙾, 𝚁𝙴𝙿𝙾𝚁𝚃𝙴𝙻𝙾 𝙰𝙻 𝙿𝚁𝙾𝙿𝙸𝙴𝚃𝙰𝚁𝙸𝙾 𝙳𝙴𝙻 𝙱𝙾𝚃', m)
}}
handler.command = /^(م9)$/i
handler.exp = 50
handler.fail = null
export default handler
function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}